"<div> <p class=\"p element-0\"> <span class=\"r element-1\">Jacob,</span> </p><p class=\"p element-2\"> <span class=\"r element-3\">Its been a while since I have had a personal conversation with you. I feel the need to address some of the evils that I have committed against you in my child and teenage years. </span> <span class=\"r element-4\">My hope is </span> <span class=\"r element-5\">you can have closure on some of the division I have caused</span> <span class=\"r element-6\">.</span> <span class=\"r element-7\"> </p><p> </span> <span class=\"r element-8\"> </p><p>When we were younger, I was especially selfish and proud. Though at the time, you would whine and complain to dad, I took it upon myself to play God and punish you. There were several times I felt I was being unjustly accused by you. In response, I lied about your behavior to mom and dad. I had also responded by slapping you in the face, violently hitting you, screaming and spitting at you.</span> <span class=\"r element-9\"> </p><p> </span> <span class=\"r element-10\"> </p><p>I also stole things from you, or hid them, damaging or defiling your property. I don't remember specific incidents, though you might.</span> <span class=\"r element-11\"> </p><p> </span> <span class=\"r element-12\"> </p><p>I have also done lewd things around the house. Running around naked, flashing you, trying to barge into the bathroom when you were using it, and </span> <span class=\"r element-13\">much worse</span> <span class=\"r element-14\">. I want you to know that these things have bothered me the most and made me sick to my stomach. I regret them so much</span> <span class=\"r element-15\"> I want to vomit;</span> <span class=\"r element-16\"> I regret being born in the first place.</span> <span class=\"r element-17\"> </p><p> </span> <span class=\"r element-18\"> </p><p>Whenever I was found out about certain things, I would threaten you, attempting to cover things up with 'pinkie swears' and other forms of coercion. They were all just ways of forcing you to do what I wanted, which is why I have been bitter, angry, despondent, confused, and more.</span> <span class=\"r element-19\"> </p><p> </span> <span class=\"r element-20\"> </p><p> </span> <span class=\"r element-21\">I </span> <span class=\"r element-22\">fear</span> <span class=\"r element-23\"> that I have in some way, given credence to you to engaging in sinful behaviors or thoughts because of my disobedience. I have defiled your mind on more than one occasion with sick, perverse, lewd thoughts, and ideas. I regret them all, and if I could take them back, I would</span> <span class=\"r element-24\">. But, </span> <span class=\"r element-25\">I can't</span> <span class=\"r element-26\">, and I hate it</span> <span class=\"r element-27\">. I don't know how to pay you back in restitution for the evil that I have committed against you</span> <span class=\"r element-28\">, other than doing right (the best I know how) by you from this point onward. </span> <a name=\"_GoBack\"></a> <span class=\"r element-29\"> </p><p> </span> <span class=\"r element-30\"> </p><p> </span> <span class=\"r element-31\">To put your mind at ease</span> <span class=\"r element-32\">, I want you to know that I renounce entirely the spirit that led to these things. I despise him, and I will not have partnership with that kind of evil any longer. I have reaped and continue to reap what I have sown, and </span> <span class=\"r element-33\">what I</span> <span class=\"r element-34\"> want is to repent and reconcile what I can. That doesn't mean that we </span> <span class=\"r element-35\">will </span> <span class=\"r element-36\">agree on all things. But, if we do come into conflict, know that unlike before I am not going to be trying to win an argument to win a fight, or to preserve myself.</span> <span class=\"r element-37\"> I want to be honest.</span> <span class=\"r element-38\"> </p><p> </span> <span class=\"r element-39\"> </p><p> </span> <span class=\"r element-40\">- Braden</span> <span class=\"r element-41\"> </p><p> </span> <span class=\"r element-42\"> </p><p>P.S. We talked about this a long time ago. I have been reading this paper and many others. I believe the writer's testimony, and what he has to say about the Holy Spirit.</span> </p><p class=\"p element-43\"> <a> <span class=\"r element-44 Hyperlink\">https://www.thepathoftruth.com/teachings/holy-spirit-baptism.htm</span> </a> </p></div>"