"<div class=\"pf-content\"><p><strong>From:</strong> Lem<br>\n<strong>To:</strong> The Path of Truth<br>\n<strong>Date:</strong> Wed, 22 Jul 2009 10:32:47 -0400 (EDT)<br>\n<strong>Subject:</strong> Eternally Lost???</p>\n<p>Hello. I have known that Jesus Christ is Lord for many years. For many years I even thought that I had salvation (once saved always saved).</p>\n<p>However, I now believe that one can fall from grace. My question is, I knew that adultery was wrong, but for many years I was involved in this horrible behavior.</p>\n<p>I just thought well I saved, God will just forgive me for my behavior and all will be well.</p>\n<p>After reading Numbers 15:30, Hebrews 6:4-6, 10:26-31, 2Pet 2:20-21 & 1John 5:16-18, it appears that I have squandered away grace due to my willful sin.</p>\n<p><h1>Header 1</h1><h2>Header 2</h2><h3>Header 3</h3><h4>Header 4</h4><h5>Header 5</h5><h6>Header 6</h6>I have since asked Jesus to forgive me of my sin, and cleanse me from all iniquity, to give me a new heart that seeks to obey Him and to do His will. I am tired of being driven to and fro by doctrine that I cannot discern truth from the lie.</p>\n<p>That’s how I came to your website looking for information regarding Darwin Fish and Gino Jennings. They seem to have a lot of truth in their messages, but I sense some falsehood mixed in there also.</p>\n<hr>\n<p><strong>From:</strong> Victor Hafichuk<br>\n<strong>To:</strong> Lem<br>\n<strong>CC:</strong> Paul Cohen<br>\n<strong>Date:</strong> 7/26/2009 3:17 PM<br>\n<strong>Subject:</strong> Re: Eternally Lost???</p>\n<p>Lem, I write you in the Name of the Lord Jesus Christ.</p>\n<p>I have some “<strong>bad” news</strong> and some <strong>Good News</strong> for you.</p>\n<p><strong><em>First, the “bad”</em></strong> – <strong><em>Once saved, NOT always saved</em></strong>.</p>\n<p>Which you say you have already been concluding. But it is <strong><em>not</em></strong> bad news really, because it is the truth. And if it is the truth, it will make you free when you believe and take it to heart, even as the Lord Jesus has said. God has His way of doing things and those ways are <strong><em>always</em></strong> good.</p>\n<p>He is showing you the fallacy or more accurately, the <strong><em>misapplication</em></strong> of the doctrine, OSAS (“Once saved, always saved”), which only He can. Now ask yourself why He would be doing that unless He intended good for you. He is not doing it to torment you; God does not act that way.</p>\n<p>Please bear with me for a great part of this letter. In it I make known the truth from the Scriptures that “once saved, always saved,” is a lie (<strong><em>in a certain context</em></strong>). You have already come to that conclusion by the mercies of God; however, I take this opportunity with you to put forth some godly argument concerning this matter for the sakes of others who also need to know it.</p>\n<p>You did indeed condemn yourself in adultery, a heinous sin indeed. You knew better; you said so. Under Moses’ law (which is not his, but God’s Law), adulterers were stoned to death. Even thieves and murderers were not specifically appointed to the violent and shameful public stoning. That is how gravely God looks upon adultery. How could you then expect Him to forgive you, especially while acting presumptuously with Him, taking His Name in vain?</p>\n<p>Now there are many false teachers today who argue, “Moses was Old Testament! That was in the dispensation of the Law! We are now under grace, in the New Covenant, and our every sin is under the blood – past, present and future. Jesus has paid for them all. We are saved and forgiven! He loves us.”</p>\n<p>While there is some truth in what they say (Satan always gives a good, strong dose of truth to conceal his lies), they err in their judgment and application of those words. The fact is that <strong><em>under grace, one has an even greater obligation to God than under the Law</em></strong>. The Bible says so – hear Jesus:</p>\n<p>“And that servant who knew his lord’s will and did not prepare, nor did according to His will, shall be beaten with many stripes. But he not knowing, and doing things worthy of stripes, shall be beaten with few stripes. <strong><em>For to whomever much is given, of him much shall be required</em></strong>. And to whom men have committed much, of him they will ask the more” (Luke 12:47-48 MKJV).</p>\n<p>Whoever teaches that a Christian can sin and get away with it is a wicked teacher, a bona fide representative of Satan and hell.</p>\n<p>As a Christian sinning, does one get a simple slap on the wrist? According to the Scriptures, the wages of sin to a believer is death (in this case, adultery is specifically named):</p>\n<p>Revelation 2:22-23 MKJV<br>\n(22) Behold, I am throwing her into a bed, and <strong><em>those who commit adultery</em></strong> with her into great affliction, unless they repent of their deeds.<br>\n(23) And I <strong><em>will kill her children with death</em></strong>. And all the churches will know that I am He who searches the reins and hearts, and <strong><em>I will give to every one of you according to your works</em></strong>.</p>\n<p>Consider what the Hebrews writer said (as you have already pointed out):</p>\n<p>“He who despised Moses’ Law died without mercy on the word of two or three witnesses. <strong><em>Of how much worse punishment</em></strong>, do you suppose, will he be thought worthy of punishment, the one who has trampled the Son of God, and who has counted the blood of the covenant with which he was sanctified an unholy thing, and has insulted the Spirit of grace?” (Hebrews 10:28-29 MKJV).</p>\n<p>This is <strong><em>New Testament</em></strong> now – the Book of Hebrews. As you have mentioned, the Hebrews writer, inspired by the Holy Spirit said:</p>\n<p>Hebrews 6:4-8 MKJV<br>\n(4) <strong><em>For it is impossible</em></strong> for those who were once enlightened, and have tasted of the heavenly gift, and were made partakers of the Holy Spirit,<br>\n(5) and have tasted the good Word of God and the powers of the world to come,<br>\n(6) and who have fallen away; it is impossible, I say, <strong><em>to renew them again to repentance</em></strong>, since they crucify the Son of God afresh to themselves and put Him to an open shame.<br>\n(7) (For the earth which drinks in the rain that comes often upon it, and brings forth plants fit for those by whom it is dressed, receives blessing from God.<br>\n(8) But that which bears thorns and briers is rejected and is a curse, whose end is to be burned.)</p>\n<p>The writer goes on to say:</p>\n<p>Hebrews 6:9-10 MKJV<br>\n(9) But, beloved, we are <strong><em>persuaded</em></strong> better things of you and things that accompany salvation, though we speak in this way.</p>\n<p>He said he is <strong><em>persuaded</em></strong> better things of them…. There is hope expressed in those words, so there is no guarantee that salvation is completely assured. Therefore, we must not fool ourselves into thinking that they cannot be lost after being saved. Now consider the next few words, particularly for your case:</p>\n<p>(10) For God is not unrighteous to forget your work and labor of love which you have shown toward His Name, in that you have ministered to the saints, and do minister.</p>\n<p>Were you showing “labor of love toward His Name” while deliberately living in adultery in those years? If so, pigs fly, don’t they? Are you going to stab both the Lord and your neighbor (more importantly, your wife or someone else’s wife and her husband, or single woman) in the heart and call that love toward Him? Were you ministering to the saints? Hardly! No, no, no, Lem, you were damned in what you did.</p>\n<p>How lust and sin do blind! What were you thinking? Why do you think Paul was warning the Corinthian saints? And did he say “try to avoid as best you can…” or “Jesus will forgive you for…” or did he say:</p>\n<p><strong><em>“FLEE</em></strong> fornication! Every sin that a man does is outside the body, but he who commits fornication sins against his own body. Or <strong><em>do you not know that your body is a temple of the Holy Spirit in you, whom you have of God</em></strong>? And <strong><em>you are not your own, for you are bought with a price</em></strong>. Therefore glorify God in your body and in your spirit, which are God’s” (1 Corinthians 6:18-20 MKJV)?</p>\n<p>Did you not know that every detail of your life will be found out? Here it is:</p>\n<p>“For nothing is secret, that shall not be made manifest; neither any thing hid, that shall not be known and come abroad” (Luke 8:17 KJV).</p>\n<p>And if found out, would the sin not be judged? Did you really think He would look the other way? He would have to deny His Law and Himself. In essence, Lem, you were mocking Him:</p>\n<p>“Do not be deceived, God is not mocked. For whatever a man sows, that he also will reap. For he sowing to his flesh will reap corruption from the flesh. But he sowing to the Spirit will reap life everlasting from the Spirit” (Galatians 6:7-8 MKJV).</p>\n<p>If there was ever a relationship with the Lord, it was entirely lost because you consciously and deliberately did that which was evil. The apostle Paul makes it very clear that God is under no obligation by law or nature to <strong><em>keep</em></strong> in “eternal security” one who is His who willfully sins:</p>\n<p>Romans 11:20-22 MKJV<br>\n(20) Well, because of unbelief they were broken off, and you stand by faith. Do not be high-minded, but fear.<br>\n(21) For if God did not spare the natural branches, <strong><em>fear lest He also may not spare you either</em></strong>!<br>\n(22) Behold then the kindness, and the severity of God; on those having fallen, severity; but on you, kindness, if you continue in the kindness. Otherwise [if you do not continue in His kindness] <strong><em>you also will be cut off</em></strong>.</p>\n<p>To whom it is given, the Word of God is quite simple and straightforward, is it not? Jesus said:</p>\n<p>“At that time Jesus answered and said, I thank You, O Father, Lord of Heaven and earth, because You have hidden these things from the sophisticated and cunning, and revealed them to babes. Even so, Father, for so it seemed good in Your sight” (Matthew 11:25-26 MKJV).</p>\n<p>Only wicked men are willing to abuse and pervert the Scriptures in their cleverness to suit their selfish fancies and fulfill their lusts. Peter said:</p>\n<p>2 Peter 2:20-22 MKJV<br>\n(20) For if they have escaped the pollutions of the world <strong><em>through the full knowledge of the Lord and Savior Jesus Christ</em></strong>, and are again entangled, they have been overcome by these, their last things are worse than the first.<br>\n(21) For it would have been better for them not to have fully <strong><em>known the way of righteousness</em></strong>, than fully knowing it, to turn from the holy commandment delivered to them.<br>\n(22) But the word of the true proverb has happened to them: The dog turning to his own vomit; and, The washed sow to wallowing in the mire.</p>\n<p>Can it be any plainer than that? Anyone who reads those words and thinks he can sin and still be saved is a wicked fool and deceives himself; he has nothing to do with the Lord, not having a new heart. New hearts in Christ never think that way.</p>\n<p>Now I will appear to contradict myself.</p>\n<p>I will now tell you that there <strong><em>is</em></strong> such a thing as “once saved, always saved,” but not until a certain time and place. The names of those who have not yet overcome can be blotted out of His Book, but there are those whose names have been recorded <strong><em>and permanently established</em></strong> in the Book of Life <strong><em>upon overcoming</em></strong> (Revelation 2 and 3):</p>\n<p>“Him who overcomes I will make him a pillar in the temple of My God, and <strong><em>he will go out no more</em></strong>. And I will write upon him the Name of My God, and the name of the city of My God, the New Jerusalem, which comes down out of Heaven from My God, and My new Name” (Revelation 3:12 MKJV).</p>\n<p>“The one who overcomes, this one will be clothed in white clothing. <strong><em>And I will not blot out his name out of the Book of Life</em></strong>, but I will confess his name before My Father and before His angels” (Revelation 3:5 MKJV).</p>\n<p>This overcoming is not at the time of physical death, as some suppose but at the time of a death within through the cross of Christ.</p>\n<p>To be blotted out of His Book of Life means that you must first be recorded in It. Is that not so? Therefore, the Lord warns those who believe that they should not be self-assured and comfortable with their status as believers, because they <strong><em>can</em></strong> be blotted out of His Book, losing what they have or think to have:</p>\n<p>“Therefore be careful how you hear. For whoever has, to him shall be given; and whoever has not, from him shall be taken even that which he seems to have” (Luke 8:18 MKJV).</p>\n<p>Hear the urgent admonition to spiritual pilgrims in Christ:</p>\n<p>Hebrews 4:1-7 MKJV<br>\n(1) Therefore, a promise being left to enter into His rest, <strong><em>let us fear</em></strong> lest any of you should seem to come short of it.<br>\n(2) For also we have had the gospel preached, as well as them. But the Word preached did not profit them, not being mixed with faith in those who heard it.<br>\n(3) For we who have believed do enter into the rest, as He said, “I have sworn in My wrath that they should not enter into My rest;” although the works were finished from the foundation of the world.<br>\n(4) For He spoke in a certain place of the seventh day in this way: “And God rested the seventh day from all His works.”<br>\n(5) And in this place again, “They shall not enter into My rest.”<br>\n(6) Since then it remains that some must enter into it, and since they to whom it was first preached did not enter in because of unbelief,<br>\n(7) He again marks out a certain day, saying in David, “Today,” (after so long a time). Even as it is said, “Today, if you will hear His voice, harden not your hearts.”</p>\n<p>But I do not see that this admonition is for you, Lem. So now for the <strong><em>Good News</em></strong>, where you are concerned. But before I give it to you, consider that according to the Scriptures already quoted in Hebrews and 2 Peter, if you had believed and then gone into deliberate and continual sin, there would be no more opportunity to be redeemed. The Hebrews writer says it is impossible.</p>\n<p>Think about it: If anyone were to “crucify the Son of God afresh to himself and put Him to an open shame,” that is, deliberately turn his back on God after knowing Him, how can it be possible to redeem such a person? No, God’s grace and mercy are great but when a person deliberately despises the Lord that way, it is a lost cause in this world; severe retribution and correction are sorely needed.</p>\n<p>I don’t believe you committed the “unpardonable sin,” as you may suspect. I do not believe you ever experienced so much as the <strong><em>first</em></strong> step of salvation, much less the next two (there are three). Here is why:</p>\n<p><strong>One,</strong> you say, “<span style=\"color: #800000;\">I have known that Jesus Christ is Lord for many years.</span>” Notice, you did not say that <strong><em>you knew Him as Lord</em></strong> but only that you knew He is Lord. There is a great difference. Devils too know He is Lord, they even believe, and tremble (James 2:19), yet they are not saved and they do not obey or willingly, humbly, gladly yield to Him as Lord.</p>\n<p><strong>Two,</strong> you say, “<span style=\"color: #800000;\">For many years I even thought that I had salvation (once saved always saved).</span>” Let me tell you this: when one is saved, he knows it; he does not just think it. (This point is not strong, I admit, for you could be saying that while you “knew” you were saved in those years, with retrospect you see that you only <strong><em>thought</em></strong> you were saved.)</p>\n<p><strong>Three,</strong> you say, “<span style=\"color: #800000;\">I knew that adultery was wrong, but for many years I was involved in this horrible behavior</span>,” and “I just thought well I saved, God will just forgive me for my behavior and all will be well.”</p>\n<p>But what does brother John say about that?</p>\n<p>“If we say that we have fellowship with Him and walk in darkness, we lie and do not practice the truth” (1 John 1:6 MKJV).</p>\n<p>“And by this we know that we have known Him, if we keep His commandments. He who says, I have known Him, and does not keep His commandments, is a liar, and the truth is not in him” (1 John 2:3-4 MKJV).</p>\n<p>“Everyone who abides in Him does not sin. <strong><em>Everyone who sins has not seen Him nor known Him</em></strong>” (1 John 3:6 MKJV).</p>\n<p>1 John 3:8-10 MKJV<br>\n(8) He who practices sin is of the Devil, for the Devil sins from the beginning. For this purpose the Son of God was revealed, that He might undo the works of the Devil.<br>\n(9) <strong><em>Everyone who has been born of God does not commit sin</em></strong>, because His seed remains in him, and <strong><em>he cannot sin</em></strong>, because he has been born of God.<br>\n(10) In this the children of God are revealed, and the children of the Devil: <strong><em>everyone not practicing righteousness is not of God</em></strong>, also he who does not love his brother.</p>\n<p>“We know that everyone who has been born of God <strong><em>does not continue to sin</em></strong>, but the one born of God guards himself, and the evil one does not touch him” (1 John 5:18 MKJV).</p>\n<p>1 John 5:16-18 MKJV<br>\n(16) If anyone sees his brother sin a sin not to death, he shall ask, and He shall give him life for those that do not sin to death. There is a sin to death, I do not say that he shall pray for it.<br>\n(17) All unrighteousness is sin, and there is a sin not to death.<br>\n(18) <strong><em>We know that everyone who has been born of God does not continue to sin, but the one born of God guards himself, and the evil one does not touch him</em></strong>.</p>\n<p>These are plain words for plain people who plainly desire the plain truth. John says that those who deliberately and consistently walk in darkness are not His. They are liars, like those of whom Jesus speaks in Revelation:</p>\n<p>“Behold, I will make them of the synagogue of Satan, which say they are Jews [<strong>Christians/believers</strong>], and are not, <strong><em>but do lie</em></strong>; behold, I will make them to come and worship before thy feet, and to know that I have loved thee” (Revelation 3:9 KJV).</p>\n<p><strong>Four,</strong> obviously, you did not want to do God’s will. A new nature in Christ <strong><em>does </em></strong>want to do His will, and you reveal that you believe this to be possibly true because you say, “I have since asked Jesus to forgive me of my sin, an cleanse me from all iniquity, <strong><em>to give me a new heart that seeks to obey Him and to do His will</em></strong>.” You did not have that “new heart that seeks to obey Him and to do His will.” You were never saved.</p>\n<p>Back to the beginning of this letter: He is showing you the fallacy or misapplication of the doctrine, OSAS (“Once saved, always saved”), which only He can. Now ask yourself why He would be doing that unless He intended good for you. He is not doing it to torment you; God does not act that way.</p>\n<p>So part of the Good News then is: <strong><em>Once lost, NOT always lost.</em></strong> Had you truly tasted of God and deliberately turned from Him, there would be no repentance available for you now. If you had <strong><em>not</em></strong> become a true Christian, then you may now be granted to repent and become one for the first time, wherein you receive both the desire and the power to reject sin:</p>\n<p>“For it is God who works in you both to will and to do of His good pleasure” (Philippians 2:13 MKJV).</p>\n<p>I don’t see any evidence in your letter that you had salvation; I see no evidence whatsoever that your name was ever entered into the Book of Life. If it had been, it would have been removed by reason of your <strong><em>deliberate and continued</em></strong> sin of adultery.</p>\n<p>But now, I see that you are asking for a true heart for God. This leads me to believe there is hope for you, that God is drawing you to Himself, for nobody seeks after God without God’s causing him to want to do so – nobody:</p>\n<p>“As it is written: ‘There is none righteous, no not one; there is none that understands, there is none that seeks after God’” (Romans 3:10-11 MKJV).</p>\n<p>“No one can come to Me unless the Father who has sent Me draw him, and I will raise him up at the last day” (John 6:44 MKJV).</p>\n<p>Those who cannot be renewed to repentance have no desire to be renewed; it is not given to them; God has cast them off – He is not drawing them. Had He cast you off entirely, as you fear, you would have no guilt or remorse for your sin, and no interest whatsoever in turning from it and doing what is right in His sight. Instead, you are under conviction of sin.</p>\n<p>Therefore, unless you are fooling yourself, simply trying to “save your skin,” and do not care about choosing right over wrong, God is drawing you to Himself that He might receive you, <strong><em>for the first time</em></strong>, into the company of His sons and daughters, that is, His saints. Is your desire to do that which is right genuine, and are you prepared to repent, to obey in whatever God commands you, and to forsake whatever is required of you by Him? If so, you are called to be His and you can be very thankful for it.</p>\n<p>“For it is God who works in you both to will and to do of His good pleasure” (Philippians 2:13 MKJV).</p>\n<p>The apostle Paul made this declaration, not in theory, philosophy, religiosity, imagination, desire, wishful thinking, or theology, but in the reality of experience:</p>\n<p>“I have been crucified with Christ, and I live; yet no longer I, but Christ lives in me. And that life I now live in the flesh, I live by faith toward the Son of God, who loved me and gave Himself on my behalf” (Galatians 2:20 MKJV).</p>\n<p>This crucifixion of the soul is what all believers must experience if they are to enter the City of God, called the Garden of Eden, called Paradise – <strong><em>here in this life</em></strong>. They must take up the cross and go all the way. (This is not to say that the full salvation process must be accomplished or fulfilled in this life, only that one must be faithful in that which he or she has been given.)</p>\n<p>Many professors of faith in Christ presume to possess the substance of Paul’s words, simply because they have “accepted Christ into their heart as personal Savior.” Most who express their initial experience with the Lord in those words have experienced nothing spiritually substantial, which is what I perceive to be the case with you.</p>\n<p>You do not indicate any dramatic life change at the time of your conversion. For those who have experienced a true conversion, the repentance is <strong><em>unmistakably</em></strong> a life-changing experience and so too is the second step, the baptism in the Holy Spirit. However, they must continue on from there in their walk to keep the third and final feast as well – the Feast of Tabernacles. As it is written, “He that endures <strong><em>to the end</em></strong>, the same shall be saved.”</p>\n<p>Three times in a year the males were to appear before the Lord (Ex. 23:17; 34:23, 24). Once or twice was not good enough. God instituted <strong><em>three</em></strong> feasts, not for nothing; the third, with the fullness of fruits harvested, being as important as the others. All were to be kept. Of what value is a sower’s work if he cannot reap the main fruits of his labors, which is what the Feast of Tabernacles is all about?</p>\n<p>The third feast included the Day of Atonement, the tenth day of the seventh month, the most solemn of all the solemn feasts, the only day of the year when the High Priest entered the Holy of Holies to sprinkle blood on the mercy seat on behalf of all Israel. Unless one enters there, he cannot receive the fullness of salvation purchased by Christ’s blood:</p>\n<p>Hebrews 10:19-39 MKJV<br>\n(19) Therefore, brothers, having boldness to enter into the Holy of Holies by the blood of Jesus,<br>\n(20) by a new and living way which He has consecrated for us through the veil, that is to say, His flesh;<br>\n(21) and having a High Priest over the house of God,<br>\n(22) let us draw near with a true heart in full assurance of faith, having our hearts sprinkled from an evil conscience and our bodies having been washed with pure water.<br>\n(23) Let us hold fast the profession of our faith <strong><em>without wavering</em></strong> (for He is faithful Who promised)</p>\n<p>If all were accomplished upon first believing, our salvation complete, there would be no need for the exhortation not to waver. Faith <strong><em>and</em></strong> patience are necessary to receive the promise. Again, Jesus said that one must endure to the end to be saved.</p>\n<p>So where is there any room for sinning along the path of truth, the way of God? Jude warns the saints of losing what they at first genuinely had. He writes:</p>\n<p>Jude 1:5-8 KJV<br>\n(5) I will therefore put you in remembrance, though ye once knew this, how that the Lord, having saved the people out of the land of Egypt, afterward destroyed them that believed not.<br>\n(6) And the angels which kept not their first estate, but left their own habitation, He hath reserved in everlasting chains under darkness unto the judgment of the great day.<br>\n(7) Even as Sodom and Gomorrah, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh, are set forth for an example, suffering the vengeance of eternal fire.<br>\n(8) Likewise also these filthy dreamers defile the flesh, despise dominion, and speak evil of dignities.</p>\n<p>Some, particularly those who believe in “once saved, always saved,” will argue that Jude speaks of those perishing who never had salvation in the first place. But ask yourself, “Why would Jude use for examples those who once were in God’s favor and lost it, if this truth did not apply to those to whom he was writing?”</p>\n<p>And since when was it expected of <strong><em>unbelievers</em></strong> to respect spiritual elders and leaders or “dignities”? Only those with faith would understand the law and principle of honoring spiritual dominion. As the Hebrews writer says:</p>\n<p>“Remember them which have the rule over you, who have spoken unto you the Word of God: whose faith follow, considering the end of their conversation” (Hebrews 13:7 KJV).</p>\n<p>Jude also uses the example of the sons of Korah and their fall from grace (<strong><em>yes,</em></strong> <strong><em>grace</em></strong> – they did not come out of Egypt by their own volition or power, but by God’s). They were of the nation of Israel, like all the others. They were saved out of Egypt. Read <a href=\"https://www.thepathoftruth.com/teachings/law-and-grace-of-god.htm\"><strong>Law and Grace</strong></a><strong>.</strong></p>\n<p>What is more, they were even sons of Levi, no less, the priesthood tribe that God chose to minister in the Tabernacle and the Temple, the same tribe from which came Aaron the High Priest and Moses, God’s prophet and deliverer of Israel.</p>\n<p>Now you say, “I am tired of being driven to and fro by doctrine that I cannot discern truth from the lie.”</p>\n<p>I hope that is true and that you intend to commit yourself to the Lord in all sincerity and earnestness.</p>\n<p>As for the men you mention, you are right – there is error there along with truth with Gino Jennings and Darwin Fish, who, for example, defends masturbation, a despicable notion no true saint would entertain. Now consider that you “sense some falsehood mixed in there also.” God is giving you that, which is another indication of hope for you. As you read our site, you will know how they are in error.</p>\n<p>What must you then do, Lem? You must come clean with your wife if you have not done so, and with every other matter and/or person. All your sins must be dealt with and restitution made wherever possible (the Lord will show you what He requires of you). Having confessed your sin to your wife, repenting of your conduct, we can pray for you and you can ask the Lord to take you, deliver, cleanse and heal you and your wife, and He will meet you face to face…</p>\n<p>if you mean business. If not, you are a dead man. Do not be double-minded with Him or you will receive nothing but wrath from Him:</p>\n<p>“For we know Him Who has said, Vengeance belongs to Me, I will repay, says the Lord. And again, The Lord shall judge <strong><em>His people</em></strong>. It is a fearful thing to fall into the hands of the living God” (Hebrews 10:30-31 MKJV).</p>\n<p>“Behold then the kindness, <strong><em>and the severity</em></strong> of God; on those having fallen, severity; but on you, kindness, if you continue in the kindness. Otherwise you also will be cut off” (Romans 11:22 MKJV).</p>\n<p>So as the Lord said to the woman caught in adultery, so we say to you:</p>\n<p>“Neither do we condemn you: go, and sin no more” (John 8:11 KJV).</p>\n<p>“Therefore, since we are receiving a kingdom that cannot be shaken, let us have grace, by which we may serve God acceptably with reverence and godly fear, for also, ‘Our God is a consuming fire’” (Hebrews 12:28-29 MKJV).</p>\n<p>Being in all earnestness, fully yielded to Him, you will find favor and great blessing, which will turn your water to wine, lemons to lemonade, and sorrow to joy. From there, all your past will be turned for good.</p>\n<p>If you question or disagree with what we say here, do not hesitate to question or differ. We are not here to be pleased. Do you understand? We are here to see to it that those who are for deliverance are delivered. Be honest and open. You cannot offend us. We are not afraid of you and we don’t want you to be afraid of us.</p>\n<p>Most of all, we don’t want you to be acting out of fear of damnation. We want you to fear the Lord, and Him alone.</p>\n<p>“Let us hear the conclusion of the whole matter. <strong><em>Fear God</em></strong>, and <strong><em>keep His commandments</em></strong>. For <strong><em>this is the whole duty of man</em></strong>. For God shall bring every work into judgment, with <strong><em>every secret thing</em></strong>, whether it is good, or whether evil” (Ecclesiastes 12:13-14 MKJV).</p>\n<p>Your way to salvation is to come clean, to get openly honest with both God and man, to come into the light and not remain hiding in darkness:</p>\n<p>“For everyone who does evil hates the Light, and does not come to the Light, lest his deeds should be exposed. But he who practices truth comes to the Light so that his works may be revealed, that they exist, having been worked in God” (John 3:20-21 MKJV).</p>\n<p>By coming to us, Lem, you have begun the process. God bless you and give you the will, faith, strength, and obedience to love Him with all your heart, your soul, your mind and strength, and to love your neighbor as yourself.</p>\n<p>Victor</p>\n<hr>\n<p><strong>From: </strong>Lem<strong><br>\nTo:</strong> Victor Hafichuk<br>\n<strong>Sent:</strong> Sunday, July 26, 2009 8:47 PM<br>\n<strong>Subject:</strong> Re: Eternally Lost???</p>\n<p>Hello Victor</p>\n<p>Thank-you for replying to my inquiry. Please be patient with me as there are still several things that I dont understand. First, since I had asked God to forgive me, and to live inside me (basically sinners prayer) I thought that I was already saved.</p>\n<p>I did ask Jesus to forgive me before and to deliver me from sin (I thought that was how one recieved salvation) However, there was no real change in my behavior/lifestyle. I went to church and read my Bible a little more, but nothing radical. I did want to obey God but I failed miserably.</p>\n<p>From what you wrote, I was never saved and can have forgiveness from the Lord. You stated “Those who cannot be renewed to repentance have no desire to be renewed; it is not given to them; God has cast them off – He is not drawing them. Had He cast you off entirely, as you fear, you would have no guilt or remorse for your sin, and no interest whatsoever in turning from it and doing what is right in His sight. Instead, you are under conviction of sin.</p>\n<p>Are you saying that since I have guilt over my sins and remorse over my sins, and desire to do what is right, that I am being led by God?</p>\n<p>Also you said that you dont want me acting out of fear of damnation, but out of fear of the Lord. Victor, to be honest I have a fear of both. I fear the Lord,  and I am afraid that I could be eternally lost. I do know that in the past I viewed porngraphy alot, indulged in masturbation etc. I tried stopping on my own, but I always fell short and went back into my sin, and tried to justify my actions. The last time i committed adultery i felt such horrible guilt. I asked God to forgive me, to cleanse me of all iniquity, to give me a new heart. I told God that what i did was wrong, and that i could not overcome my sin without Him. I destroyed all my pornographic material, stopped masturbating and committing adultery. To God i give the glory for this because i could not do this before.</p>\n<p>Several months later I was re-baptized to show my commitment to the Lord.</p>\n<p>Victor, I really don’t know how to be saved, but I want salvation, and I want to be sure that I am forgiven. I know that one is not saved by works, but by the death, burial and resurrection of Christ. How do I grasp His gift of salvation?? I use to converse alot with a pastor at Good News Messengers church (about 1yr ago)  <a href=\"http://www.gnmc.us/\" class=\"external\" rel=\"nofollow\" target=\"_blank\">www.gn</a><a href=\"http://www.gnmc.us/\" class=\"external\" rel=\"nofollow\" target=\"_blank\">m</a><a href=\"http://www.gnmc.us/\" class=\"external\" rel=\"nofollow\" target=\"_blank\">c.us/</a> i told him that i use to believe in OSAS, but now i believe that one can lose their salvation. The pastor from the site then told me that if anyone believed that they could lose their salvation, he/she cannot be saved because they are believing a different gospel.</p>\n<p>I have confessed to my wife that i was unfaithful, but i dont think she knows to how extensive it was. Basically, i told her that i cheated on her alot and that i was sorry, and if she forgave me. she said yes.</p>\n<p>Victor, I want salvation, forgiveness, strength and steadfastness to obey the lord, To love God more than anything, baptism of the Holy Ghost. These are the things i want. Also, do you know where i can purchase a modern King James Version? I cant fine one anywhere, not even on amazon.com</p>\n<p>I ask that pray for my requests, if they are acceptable desires. I will be reading your site in addition to the Bible for guidance. If possible, I would like to call you to discuss my situation in more detail as I am a poor writer. My number is XXX XXX XXXX. is it possible that I can call you?</p>\n<p>Please keep me in prayer. May God in is abundant grace and mercy guide my into the path of righteousness, and to deliver me from sin.</p>\n<p>God please forgive me for I have sinned against you. I am sorry. Lem</p>\n<hr>\n<p><strong>From:</strong> Victor Hafichuk<br>\n<strong>To:</strong> Lem<br>\n<strong>CC:</strong> Paul Cohen<br>\n<strong>Date:</strong> 7/27/2009 6:55 PM<br>\n<strong>Subject</strong>: Our Blessed Hope</p>\n<p>Hi Lem,</p>\n<p>Your described state much reminds me of where I was at before I experienced the cleansing and deliverance of repentance (before I became a believer).</p>\n<p>There are many that have prayed “the sinner’s prayer,” and have been deceived into thinking they are saved. Consequences follow, sooner or later, as they have with you. I think you are a classic example of the bane of false conversions, of which there are millions.</p>\n<p>Now, if you go to my testimony, you will find that I am not against “the sinner’s prayer” kind of conversion per se. However, there are some important differences between the common, religious “sinner’s prayer” and what occurred with me. The most important of them was that I was not just going through the motions, as most do when they are being proselytized into some church, religious organization, movement, or event like a Billy Graham Crusade (those are almost all, if not always all, spurious conversions). I meant business and God meant business; He brought me to the end of myself; it was do or die for me.</p>\n<p>The second difference was that I was not viewing the “sinner’s prayer” as some magic formula or easy ticket. I knew (albeit not consciously so much) I was facing something that would have revolutionary implications for me, though I did not really know what those would be.</p>\n<p>Perhaps a third difference was that it was not just a matter of receiving something for myself, but of doing God’s will from then on. These false gospel conversions with the sinner’s prayer of “accepting Jesus into the heart” are misleading. Many are left expecting everything to be beautiful, with hardly a change or obligation created in one’s everyday life except to perhaps join a church and attend regularly. Even there, the change is often a selfish one. What person doesn’t want more friends and all sorts of social benefits and connections? The whole process is man-made and highly deceptive.</p>\n<p>Man’s proselytization is a lie that leads to death and hell (separation from God with darkness and torment), as it has with you. Sooner or later, the chickens come home to roost. The fruits always manifest.</p>\n<p>When a man truly repents and turns to Christ and Christ receives him, his whole life changes dramatically. There is no stone left unturned. Your testimony is that your life remained pretty much the same – in sin. There was no repentance or conversion there at all in the beginning.</p>\n<p>You now ask, “Are you saying that since I have guilt over my sins and remorse over my sins, and desire to do what is right, that I am being led by God?”</p>\n<p>The answer is a definite “Yes.” It cannot happen any other way. On that the Scriptures are very clear, as I quoted them to you. God would not deceive or tease you.</p>\n<p>Your honest confession that you not only fear God but damnation is another indication that God has not cast you aside. You remind me that before I was converted, I too feared damnation, in the form of eternal hellfire torment, as a result of my religious upbringing in the Catholic Church.</p>\n<p>But I believe the primary thing that drove me to God was my emptiness and hunger for more in life. I now look back and see that God was taking away any pleasure of the things of this world and preparing me for better things. I also knew I was wrong in my sins, and as with you, I was powerless to overcome them on my own, though I wanted so much to put them behind me forever.</p>\n<p>According to your testimony here, God did give you grace to confess your wrong and to turn from the sins you mentioned, and you rightly give Him the credit for all that; you candidly and honestly confess that you could not have done it without Him. Yet you have suffered the guilt and the fear of damnation since, as you say. Am I right?</p>\n<p>The simple matter is that you must come through all the way, regardless of where you are. Is that not so? Obviously, you do not wish to live with guilt and doubt indefinitely. Certainly it is not God’s will that you remain in that state, and it is not part of true conversion in fruition. You can have the joy of salvation, and unless you have it, something is unfinished or askew.</p>\n<p>Rebaptism and any other external works will never solve the problem.</p>\n<p>Of the pastor at Good News Messengers church you say, “The pastor from the site then told me that if anyone believed that they could lose their salvation, he/she cannot be saved because they are believing a different gospel.”</p>\n<p>He is wrong. Furthermore, I viewed their site and sadly, they are destroying themselves in their own righteousness. Among other things, cancer is plaguing them, one of the diseases God would remove from the Israelites if they obeyed His Commandments:</p>\n<p>“And he said, If with all your heart you will give attention to the Voice of the Lord your God, and do what is right in His eyes, giving ear to His orders and keeping His laws, I will not put on you any of the diseases which I put on the Egyptians: for I am the Lord your life-giver” (Exodus 15:26 BBE).</p>\n<p>How much more would He remove horrible diseases from His saints in Christ as they obey Him:</p>\n<p>“The Lord God is our sun and our strength: the Lord will give grace and glory: He will not keep back any good thing from those whose ways are upright” (Psalms 84:11 BBE).</p>\n<p>They use religious images in their building and on their site, contrary to the Second Commandment, observe pagan celebrations (birthdays) while preaching against such; they condemn the gifts of the Spirit (and of course, being baptized in the Holy Spirit); they preach eternal torment, emphasize externals – the list goes on and on.</p>\n<p>Read <a href=\"https://www.thepathoftruth.com/falsehood-exposed/true-marks-of-a-cult.htm\">The True Marks of a Cult</a> and forever walk away from “Good News Messenger Church” (a name of blasphemy), if you know what is good for you. God’s wrath is on them and they will not listen. I feel badly for them. God grant you the wisdom to know and comprehend. This He will do as you seek after Him, believe, and obey.</p>\n<p>You write, “Victor, I want salvation, forgiveness, strength and steadfastness to obey the lord, To love God more than anything, baptism of the Holy Ghost. These are the things i want.”</p>\n<p>If that is true, and God knows your heart, you shall have all that and more, Lem; no fear.</p>\n<p>You ask about an MKJV Bible. You should be able to download one from <a href=\"http://www.e-sword.net/downloads.html\" class=\"external\" rel=\"nofollow\" target=\"_blank\">http://www.e-sword.net/downloads.html</a> where we got ours. In hardcopy, I don’t know, but I expect it will be available somewhere. But this is not a real issue for you anyway. Frankly, several translations will serve you well; it is more a matter of the heart and God’s revelation to you than anything concerning man’s translations.</p>\n<p>Finally, you write, “May God in is abundant grace and mercy guide my into the path of righteousness, and to deliver me from sin. God please forgive me for I have sinned against you. I am sorry.”</p>\n<p>To that we say “Amen! So let it be done according to your faith.” Read this letter, our site, and if you still wish to talk, we are available. Paul can call you (he has a phone plan) and we can do a three-way. Let us know.</p>\n<p>I have no doubt of hope for you, Lem. He will not cast you away if I know anything about your words and spirit in these letters and the chat you had with Paul. The Lord certainly is not telling us otherwise, which normally He would if there was a problem.</p>\n<p>Father, Your will. Thank You.</p>\n<p>Victor</p>\n<hr>\n<p><strong>From: </strong>Lem<strong><br>\nTo:</strong> Victor Hafichuk<br>\n<strong>Sent:</strong> Wednesday, July 29, 2009 6:24 PM<br>\n<strong>Subject:</strong> Bereans</p>\n<p>Hello Victor</p>\n<p>Thanks to you, Paul, and Sara for talking with me on the telephone yesterday. I was doing some reading yesterday, and it seems as if so many  so called Bible scholars, pastors, evangelists etc. have differing views on what/who/how one becomes a Christian/doctrine etc. Why all the differences? The apostles did not have such differences as this did they?</p>\n<p>For example i was reading a booklet called “Where are the dead” by Oakland Bible Students, after reading several chapters it appears that the book has a Jehovahs Witness slant, which can also be detected by their other booklet called “Divine Plan of the Ages” Which if I’m not mistaken was written by a Charles Taze Russell. They along with many others back up their positions/arguments with certain scriptures and interpretations of what those scriptures mean.</p>\n<p>What is the correct method to search the scriptures as the Bereans did to discern true from false? What other materials do i need beside Bible to make this task easier? concordance, Bible dictionary etc? For example, how would I conduct a Berean like search for truth on a topic such as “where are the dead”, or “true repentace”. How should I begin to begin a study such as this. Then i could use the same method to discern a false teaching from a true teaching.</p>\n<p>Thanks and God<br>\nBless Lem</p>\n<hr>\n<p><strong>Subject:</strong> Re: Bereans<br>\n<strong>From:</strong> Victor Hafichuk<br>\n<strong>To:</strong> Lem<br>\n<strong>CC:</strong> Paul Cohen<br>\n<strong>Date:</strong> 7/30/2009 10:15 AM</p>\n<p>Yes, Lem, the Bible Students are those who parted with the group now calling itself the JW’s. Their doctrines are quite similar and neither group knows the Lord Jesus Christ. Neither does either believe in His Divinity, so enough there, but if you wish to know more about JW’s, our site has it.</p>\n<p>What should it matter where the dead are? Is it not life in this world that interests you?</p>\n<p>Read your Bible and read at our site, like we said. Our site also has <a href=\"https://www.thepathoftruth.com/teachings/repentance.htm\">Repentance</a>, <a href=\"https://www.thepathoftruth.com/teachings/obedience.htm\">Obedience</a>, <a href=\"https://www.thepathoftruth.com/teachings/what-is-faith-spiritual.htm\">What Is Faith?</a>, <a href=\"https://www.thepathoftruth.com/teachings/holy-spirit-baptism.htm\">The Baptism in the Holy Spirit</a>, and <a href=\"https://www.thepathoftruth.com/teachings/how-one-is-saved.htm\">How One Is Saved</a>, which topics are pertinent to your situation.</p>\n<p>As to the Bereans, the “correct method” you ask for is to believe. If you read the passage carefully, they <strong><em>first</em></strong> believed Paul and Silas, and then searched the Scriptures (the Old Testament):</p>\n<p>“And these were more noble than those of Thessalonica, in that <strong>they received the Word with all readiness of mind</strong> and searched the Scriptures daily to see if those things were so” (Acts 17:11 MKJV).</p>\n<p>Until you have faith, you can study until you pile up 10 PhD’s in “theology” and Scripture analysis and it will do you no good whatsoever. You seem to have it the other way around than how the Bereans had it – the cart before the horse; However, you are missing the horse.</p>\n<p>Are you an unstable one, Lem, double-minded, someone who must jump all about and never commit or find the Answer? So it seems. We have told you what to do but you do not believe us.</p>\n<p>“He who is of God hears God’s Words. Therefore you do not hear them because you are not of God” (John 8:47 MKJV).</p>\n<p>I would also suggest you change your email name. It is a presumptuous one. There is no “holy fire” there, assuming you presume to represent or produce it somehow.</p>\n<p>Victor</p>\n<p>Lem, Paul here.</p>\n<p>What we are saying to you is that if you listen and follow what we say, in deference to the Lord and His provision for you through us, it will go well for you. If you don’t, it won’t go well. If you ignore direction and counsel, what use do you have for God? You aren’t searching for Him or for His sake, but rather to gather knowledge and to bolster your self-confidence.</p>\n<p>This is also the answer to your question about why there are so many differing views on substantive matters among those professing Christ. They, like you, are set on doing their own thing, each person for him or herself. Thus confusion and disunity reign.</p>\n<hr>\n<p><strong>From: </strong>Lem<br>\n<strong>To:</strong> Victor Hafichuk<br>\n<strong>Sent:</strong> Thursday, July 30, 2009 11:50 AM<br>\n<strong>Subject:</strong> Re: Bereans</p>\n<p>Hello Victor & Paul</p>\n<p>That was not the response that wanted to hear. However, truth is truth, and If I need correction then so be it. I will accept the correction and listen. Paul you wrote “What we are saying to you is that if you listen and follow what we say, in deference to the Lord and His provision for you through us, it will go well for you. If you don’t, it won’t go well. If you ignore direction and counsel, what use do you have for God? You aren’t searching for Him or for His sake, but rather to gather knowledge and to bolster your self confidence.</p>\n<p>True, I do want confidence in knowing that I am serving God the way He commands, and that I am forgiven. I pray that God allows me to search Him for His sake instead of gathering knowledge to bolster my self confidence. Victor, what do you mean by “Are you an unstable one, Lem, double-minded, someone who must jump all about and never commit or find the Answer? So it seems. We have told you what to do but you do not believe us.”</p>\n<p>“He who is of God hears God’s Words. Therefore you do not hear them because you are not of God” (John 8:47 MKJV).</p>\n<p>I would also suggest you change your email name. It is a presumptuous one. There is no “holy fire” there, assuming you presume to represent or produce it somehow.”</p>\n<p>I was told before by someone to change my email address to one that is more honorable to God. That i thought I did by changing it to Holyfire. I do want to be double minded. Why am I doing all the wrong things when I want to do right. I feel like I am facing defeat after defeat. However, I am not going to stop seeking God, and I definitely want to be of God. Thanks Lem</p>\n<hr>\n<p><strong>From: </strong>Lem<strong><br>\nTo:</strong> Victor Hafichuk<br>\n<strong>Sent:</strong> Thursday, July 30, 2009 12:01 PM<br>\n<strong>Subject:</strong> Re: Bereans</p>\n<p>Sorry, in last email i had a typo. I meant to say I do not want to be double-minded. Victor, something is amiss here. What am I doing wrong?? I want to be of good service to the Lord. Should all these happen at once, or will it take time?.</p>\n<p>I am going to read your article on what is faith. I pray that God will open my mind, eyes, ears, and heart so that i learn what true faith is. May He grant me the gift of faith. Going to go read it now ASAP. Thanks and God Bless Lem.   Please don’t give up on me</p>\n<hr>\n<p><strong>From: </strong>Lem<br>\n<strong>To: </strong>Victor Hafichuk<br>\n<strong>Sent: </strong>Thursday, July 30, 2009 2:53 PM<br>\n<strong>Subject: </strong>Hypocrite<strong><br>\n</strong><br>\nHello Victor</p>\n<p>From reading information regarding The Church from your website, I can see that I was a hypocrite, walking in the self deception of my mind thinking that I could wilfully disobey God, get away with as much sin as possible, yet consider myself a child of God..what sham I was.</p>\n<p>Here is the quote from your article “This much is true and should end all debate about whether a Christian (saint) can be lost or not: if he believes and obeys the Lord, he will not fall, he will not perish. Only rebels will tempt God; only the phonies, the hypocrites will deliberately sin, thinking or seeing if they can get away with it. So in obedience salvation is guaranteed; in disobedience one is not fit for the kingdom of God anyway; destruction is guaranteed instead.”</p>\n<p>So, since i have done those things, I must turn to God in faith and obedience so that I can live. Thanks be to God for this information. Lem</p>\n<hr>\n<p><strong>From:</strong> Lem<br>\n<strong>To:</strong> Paul<br>\n<strong>Date:</strong> 9/10/2009 6:39 PM<br>\n<strong>Subject:</strong> Teachings</p>\n<p>Hello Victor, Paul, and Sara</p>\n<p>I have been reading my Bible, and the material that you suggested that I read. Additionally, I have changed my email as Victor suggested. I did not mean for the email name to sound presumptuous. Please keep me in prayer, that I may sincerely seek to know God and to do His will, no matter the cost.</p>\n<p>God Bless Lem</p>\n<div id=\"wpdevar_comment_1\" style=\"width:100%;text-align:left;\">\n        <span style=\"padding: 10px;font-size:12px;font-family:Helvetica Neue,Helvetica,Arial,sans-serif;color:#000000;\">Facebook Comments</span>\n        <div class=\"fb-comments fb_iframe_widget fb_iframe_widget_fluid\" data-href=\"http://www.thepathoftruth.com/letters/am-i-eternally-lost.htm\" data-order-by=\"reverse_time\" data-numposts=\"8\" data-width=\"100%\" style=\"display:block;\" fb-xfbml-state=\"rendered\"><span style=\"height: 178px;\"><iframe id=\"f2adc8f0b23c72\" name=\"f19f349ddb477f4\" scrolling=\"no\" title=\"Facebook Social Plugin\" class=\"fb_ltr\" src=\"https://www.facebook.com/plugins/comments.php?api_key=1429659900378020&channel_url=https%3A%2F%2Fstaticxx.facebook.com%2Fconnect%2Fxd_arbiter%2Fr%2F0P3pVtbsZok.js%3Fversion%3D42%23cb%3Df17c085f361b7f%26domain%3Dwww.thepathoftruth.com%26origin%3Dhttps%253A%252F%252Fwww.thepathoftruth.com%252Ff1ab7d2a755613%26relation%3Dparent.parent&href=http%3A%2F%2Fwww.thepathoftruth.com%2Fletters%2Fam-i-eternally-lost.htm&locale=en_US&numposts=8&order_by=reverse_time&sdk=joey&version=v2.3&width=100%25\" style=\"border: none; overflow: hidden; height: 178px; width: 100%;\"></iframe></span></div></div></div>"